# yolov5-person-off-performance.yaml
nc: 1  # person only
depth_multiple: 0.33
width_multiple: 0.25

anchors:
  - [10,13,16,30,33,23]  # P3/8
  - [30,61,62,45,59,119] # P4/16
  - [116,90,156,198,373,326] # P5/32

backbone:
  [
    # Lightweight variant: reduced channels/repeats to target ~1 GFLOP @ img=256
    # Use canonical YOLOv5 module arg styles to avoid parser misinterpretation
    # Conv -> [out_channels, kernel, stride]
    [-1,1,Conv,[6,3,1]],     # 0: in 3 -> out 6, k=3, s=1
    [-1,1,Conv,[12,3,2]],    # 1: out 12, k=3, s=2
    [-1,1,C3,[12]],          # 2: C3 -> out 12, n defaults
    [-1,1,Conv,[24,3,2]],    # 3: out 24, k=3, s=2
    [-1,1,C3,[24]],          # 4: C3 -> out 24
    [-1,1,Conv,[48,3,2]],    # 5: out 48, k=3, s=2
    [-1,2,C3,[48,2]],        # 6: C3 -> out 48, n=2
    [-1,1,SPPF,[48,3]],      # 7 kernel=3
  ]

head:
  [
  [-1,1,Conv,[24,1,1]],
    [-1,1,nn.Upsample,[None,2,"nearest"]],
    [[-1,4],1,Concat,[1]],
  [-1,1,C3,[24]],

  [-1,1,Conv,[24,3,2]],
    [[-1,5],1,Concat,[1]],
  [-1,1,C3,[48,1]],

    [[3,6,7],1,Detect,[nc,anchors]],
  ]

